src/DataProcessors/ОтчетОКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОтчетОКонтактнойИнформации</Name>
			<Comment>Отчет о контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагентаВОтчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбораКомпоновщикаДанных</Name>
					<Comment>Настройки отбора компоновщика данных</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКонтактнуюИнформациюКонтактныхЛиц</Name>
					<Comment>Истина - выводить контактную информацию контактных лиц; Ложь - не выводить</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
					<Comment>Объекты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыКонтактнойИнформации</Name>
					<Comment>Виды выводимой контактной информации</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидыКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыПодтверждающихДокументов</Name>
					<Comment>Виды подтверждающих документов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидыПодтверждающихДокументов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ОтчетОКонтактнойИнформации/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = Обработки.ОтчетОКонтактнойИнформации.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	Объект.НастройкиОтбораКомпоновщикаДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Объект.НастройкиОтбораКомпоновщикаДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	СтруктураИзХранилища = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("ОтчетОКонтактнойИнформации", "ОбъектОтчета");
	
	Если СтруктураИзХранилища = Неопределено Тогда
		Объект.ВидКонтрагентаВОтчете = Справочники.ВидыКонтактнойИнформации.СправочникКонтрагенты;
		ВидКонтрагента = "Контрагенты";
		Обработки.ОтчетОКонтактнойИнформации.ЗаполнитьНачальныеНастройки(Объект);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты";
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			НоваяСтрока = Объект.Объекты.Добавить();
			НоваяСтрока.Контрагент = РезультатЗапроса.Ссылка;
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	Объект.ВидКонтрагентаВОтчете = СтруктураИзХранилища.ВидКонтрагентаВОтчете;
	Объект.ВыводитьКонтактнуюИнформациюКонтактныхЛиц = СтруктураИзХранилища.ВыводитьКонтактнуюИнформациюКонтактныхЛиц;
	
	Для Каждого Строка Из СтруктураИзХранилища.ВидыКонтактнойИнформации Цикл
		НоваяСтрока = Объект.ВидыКонтактнойИнформации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	Для Каждого Строка Из СтруктураИзХранилища.ВидыПодтверждающихДокументов Цикл
		НоваяСтрока = Объект.ВидыПодтверждающихДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	Для Каждого Строка Из СтруктураИзХранилища.Объекты Цикл
		НоваяСтрока = Объект.Объекты.Добавить();
		НоваяСтрока.Контрагент = Строка.Контрагент;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.СохранениеПечатнойФормы") Тогда
		
		Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			
			ФайлыВоВременномХранилище = ПоместитьТабличныеДокументыВоВременноеХранилище(ВыбранноеЗначение);
			
			Если ВыбранноеЗначение.ВариантСохранения = "СохранитьВПапку" Тогда
				СохранитьОтчетыВПапку(ФайлыВоВременномХранилище, ВыбранноеЗначение.ПапкаДляСохранения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	СтруктураДляХранилища = Новый Структура();
	СтруктураДляХранилища.Вставить("ВидКонтрагентаВОтчете", 					Объект.ВидКонтрагентаВОтчете);
	СтруктураДляХранилища.Вставить("ВидыКонтактнойИнформации", 					Объект.ВидыКонтактнойИнформации.Выгрузить());
	СтруктураДляХранилища.Вставить("ВидыПодтверждающихДокументов", 				Объект.ВидыПодтверждающихДокументов.Выгрузить());
	СтруктураДляХранилища.Вставить("ВыводитьКонтактнуюИнформациюКонтактныхЛиц", Объект.ВыводитьКонтактнуюИнформациюКонтактныхЛиц);
	СтруктураДляХранилища.Вставить("Объекты", 									Объект.Объекты.Выгрузить());
	ОбщегоНазначения.ХранилищеНастроекДанныхФормУдалить(  "ОтчетОКонтактнойИнформации", "ОбъектОтчета", ПараметрыСеанса.ТекущийПользователь);
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("ОтчетОКонтактнойИнформации", "ОбъектОтчета", СтруктураДляХранилища,,ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("ВидКонтрагентаВОтчете",Объект.ВидКонтрагентаВОтчете);
	ПараметрыОтчета.Вставить("ВыводитьКонтактнуюИнформациюКонтактныхЛиц",Объект.ВыводитьКонтактнуюИнформациюКонтактныхЛиц);
	ПараметрыОтчета.Вставить("ВидыКонтактнойИнформации",Объект.ВидыКонтактнойИнформации);
	ПараметрыОтчета.Вставить("ВидыПодтверждающихДокументов",Объект.ВидыПодтверждающихДокументов);
	ПараметрыОтчета.Вставить("Объекты",Объект.Объекты);
	ОбработчикОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОтбора", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОтчетОКонтактнойИнформации.Форма.ФормаНастроек", ПараметрыОтчета, ЭтотОбъект,,,, ОбработчикОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("ОбщаяФорма.СохранениеПечатнойФормы", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	ТаблДок = Обработки.ОтчетОКонтактнойИнформации.СформироватьТабличныйДокумент(Объект);
	Результат = ТаблДок;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьОтчетыВПапку(СписокФайловВоВременномХранилище, Знач Папка = "")
	
	#Если ВебКлиент Тогда
		Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
			ПолучитьФайл(ФайлДляЗаписи.АдресВоВременномХранилище, ФайлДляЗаписи.Представление);
		КонецЦикла;
		Возврат;
	#КонецЕсли
	
	Папка = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Папка);
	Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
		ПолноеИмяФайла = Папка + ФайлДляЗаписи.Представление;
		Файл = Новый Файл(ПолноеИмяФайла);
		ИмяБезРасширения = Файл.ИмяБезРасширения;
		Расширение = Файл.Расширение;
		
		Счетчик = 1;
		Пока Файл.Существует() Цикл
			Счетчик = Счетчик + 1;
			Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
		КонецЦикла;
		ПолноеИмяФайла = Файл.ПолноеИмя;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДляЗаписи.АдресВоВременномХранилище);
		ДвоичныеДанные.Записать(ПолноеИмяФайла);
	КонецЦикла;
	
	Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + Папка);
	
КонецПроцедуры //СохранитьОтчетыВПапку()

&НаСервере
Функция ПоместитьТабличныеДокументыВоВременноеХранилище(НастройкиСохранения)
	Перем ЗаписьZipФайла, ИмяАрхива;
	
	РезультатПроцедуры = Новый Массив;
	
	// подготовка архива
	Если НастройкиСохранения.УпаковатьВАрхив Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	ИспользованныеИменаФайлов = Новый Соответствие;
	
	ВыбранныеФорматыСохранения = НастройкиСохранения.ФорматыСохранения;
	ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	
	// сохранение печатных форм
	ОбработанныеПечатныеФормы = Новый Массив;
	
	ИмяФайла = ?(ПолучитьЗначениеПараметраСтруктуры(НастройкиСохранения, "ИмяФайла")=Неопределено, НСтр("ru = 'Отчет о контактной информации'"), НастройкиСохранения.ИмяФайла);
	
	Для Каждого ТипФайла Из ВыбранныеФорматыСохранения Цикл
		НастройкиФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("ТипФайлаТабличногоДокумента", ТипФайла))[0];
		
		Если НастройкиФормата.ТипФайлаТабличногоДокумента = ТипФайлаТабличногоДокумента.ANSITXT И ВыбранныеФорматыСохранения.Найти(ТипФайлаТабличногоДокумента.TXT) <> Неопределено И ЗаписьZipФайла <> Неопределено Тогда
			ПредставлениеФайла = ИмяФайла + "ANSI." + НастройкиФормата.Расширение;
		Иначе
			ПредставлениеФайла = ИмяФайла + "." + НастройкиФормата.Расширение;
		КонецЕсли;
		
		ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ПредставлениеФайла;
		// Файл может не записаться по разным причинам операционной системы (защищен от записи диск, нет памяти...).
		Попытка
			Результат.Записать(ПолноеИмяФайла, ТипФайла);
		Исключение
			ВывестиСообщение(НСтр("ru = 'Не удалось записать файл по причине:'") + " " + ОписаниеОшибки(), ЭтотОбъект);
			Возврат РезультатПроцедуры;
		КонецПопытки;
		
		Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
			ВставитьКартинкиВHTML(ПолноеИмяФайла);
		КонецЕсли;
		
		Если ЗаписьZipФайла <> Неопределено Тогда 
			ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
		Иначе
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
			ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);
			ОписаниеФайла = Новый Структура;
			ОписаниеФайла.Вставить("Представление", ПредставлениеФайла);
			ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
			Если ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT Тогда
				ОписаниеФайла.Вставить("Кодировка", "windows-1251");
			КонецЕсли;
			РезультатПроцедуры.Добавить(ОписаниеФайла);
		КонецЕсли;
	КонецЦикла;
	
	// если архив подготовлен, записываем и помещаем его во временное хранилище
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Записать();
		ФайлАрхива = Новый Файл(ИмяАрхива);
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ИмяФайла + ".zip");
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		РезультатПроцедуры.Добавить(ОписаниеФайла);
		УдалитьФайлы(ИмяАрхива);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременнойПапки);
	
	Возврат РезультатПроцедуры;
	
КонецФункции //ПоместитьТабличныеДокументыВоВременноеХранилище()

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок = ФайлHTML.ИмяБезРасширения + "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// ожидается, что в папке будут только картинки
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ИмяПапкиКартинок + "\" + ФайлКартинки.Имя, КартинкаТекстом);
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры //ВставитьКартинкиВHTML()

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОтбора(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВидКонтрагентаВОтчете = РезультатОповещения.ВидКонтрагентаВОтчете;
	Объект.ВыводитьКонтактнуюИнформациюКонтактныхЛиц = РезультатОповещения.ВыводитьКонтактнуюИнформациюКонтактныхЛиц;
	Объект.Куратор = РезультатОповещения.Куратор;
	Объект.ВидыКонтактнойИнформации.Очистить();
	Объект.ВидыПодтверждающихДокументов.Очистить();
	Объект.Объекты.Очистить();
	Для Каждого Строка Из РезультатОповещения.ВидыКонтактнойИнформации Цикл
		НоваяСтрока = Объект.ВидыКонтактнойИнформации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	Для Каждого Строка Из РезультатОповещения.ВидыПодтверждающихДокументов Цикл
		НоваяСтрока = Объект.ВидыПодтверждающихДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	Для Каждого Строка Из РезультатОповещения.Объекты Цикл
		НоваяСтрока = Объект.Объекты.Добавить();
		НоваяСтрока.Контрагент = Строка.Контрагент;
	КонецЦикла;
	
	СохранитьНастройки = Истина;
	
	// Сформируем отчет
	СформироватьНаСервере();
	
КонецПроцедуры

#КонецОбласти
